<a href="https://colab.research.google.com/github/pannacottabr/Analise-de-dados-com-python-e-pandas/blob/master/aula2depandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#importando a biblioteca pandas
import pandas as pd

In [ ]:
#leitura dos arquivos
df1 = pd.read_excel("/content/drive/MyDrive/Aracaju.xlsx")
df2 = pd.read_excel("/content/drive/MyDrive/Fortaleza.xlsx")
df3 = pd.read_excel("/content/drive/MyDrive/Natal.xlsx")
df4 = pd.read_excel("/content/drive/MyDrive/Recife.xlsx")
df5 = pd.read_excel("/content/drive/MyDrive/Salvador.xlsx")

In [ ]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [ ]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [ ]:
#Verificando amostra
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
117    Aracaju 2018-01-01  170.97    1521     4
109    Aracaju 2018-01-01   51.64    1523     5
4     Salvador 2019-02-14   19.47    1037     3
59   Fortaleza 2019-01-01    6.31    1002     3
1     Salvador 2018-01-01   19.02    1034     3

In [ ]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
#Alterando o tipo de dado lojaID
df["LojaID"] = df["LojaID"].astype("object")

In [ ]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [ ]:
#tratando valores faltantes
#consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
#Substituindo os valores faltantes pela média
df["Vendas"].fillna(df["Vendas"].mean(),inplace=True)

In [ ]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
120     Recife 2019-03-02  184.90    982     4
100   Salvador 2019-01-01  190.97   1036     2
118    Aracaju 2018-01-01    3.34   1522     1
68       Natal 2018-06-22  274.00    852     3
101      Natal 2019-01-02   32.28   1035     3
100      Natal 2019-01-02  190.97   1036     2
49   Fortaleza 2019-01-01  183.33   1002     6
139     Recife 2019-03-02  141.16    980     7
236      Natal 2019-01-03  126.29   1035     3
27      Recife 2019-01-01   22.25    980     7
129      Natal 2019-01-02  125.66   1037     1
231      Natal 2019-01-03   89.85   1034     2
58      Recife 2019-01-01    8.02    983     2
9        Natal 2018-05-02  261.00    852     3
59    Salvador 2019-01-01  138.27   1034     2

In [ ]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0,inplace=True)

In [ ]:
#Apagando as linhas com valores nulos
df.dropna(subset=["Vendas"],inplace=True)

In [ ]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all",inplace=True)

In [ ]:
#Criando a coluna de receita
df["receita"] = df["Vendas"].mul(df["Qtde"])

In [ ]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  receita
0  Aracaju 2018-01-01  142.00    1520     1   142.00
1  Aracaju 2018-01-01   14.21    1522     6    85.26
2  Aracaju 2018-01-01   71.55    1520     1    71.55
3  Aracaju 2018-01-01    3.01    1521     7    21.07
4  Aracaju 2018-01-01   24.51    1522     8   196.08

In [ ]:
df["receita/Vendas"] = df["receita"] / df["Vendas"]

In [ ]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde  receita
0  Aracaju 2018-01-01  142.00    1520     1   142.00
1  Aracaju 2018-01-01   14.21    1522     6    85.26
2  Aracaju 2018-01-01   71.55    1520     1    71.55
3  Aracaju 2018-01-01    3.01    1521     7    21.07
4  Aracaju 2018-01-01   24.51    1522     8   196.08

In [ ]:
#Retornando a maior receita
df["receita"].max()

3544.0

In [ ]:
#Retornando a menor receita
df["receita"].min()

3.34

In [ ]:
#nlargest
df.nlargest(3, "receita")

   Cidade       Data  Vendas LojaID  Qtde  receita  receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0